Repository: andre-romano/file_conversor
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: hi_in

source: unrecognized arguments: %s
hi_in: अपरिचित आर्ग्यमन्ट: %s

source: ERROR
hi_in: त्रुटि

source: File
hi_in: फ़ाइल

source: not found
hi_in: नहीं मिला

source: Missing dependencies detected
hi_in: अनुपलब्ध निर्भरताएँ (missing dependencies) पाई गईं

source: Install package manager for the current user?
hi_in: वर्तमान यूज़र के लिए पैकेज मैनेजर स्थापित करें?

source: Package Manager Installation
hi_in: पैकेज मैनजर स्थापना

source: SUCCESS
hi_in: सफलता

source: Install missing dependencies for the current user?
hi_in: वर्तमान उपयोगकर्ता के लिए अनुपलब्ध निर्भरताएं (missing dependencies) इन्स्टॉल करें?

source: External Dependencies Installation
hi_in: बाहरी निर्भरता स्थापना (external dependencies installation)

source: Config file
hi_in: कॉन्फ़िग फ़ाइल

source: does not exist
hi_in: मौजूद नहीं

source: Loading
hi_in: लोड हो रहा है

source: Found
hi_in: मिला

source: stages
hi_in: चरण

source: Processing stage
hi_in: प्रोसेसिंग स्टेज

source: Stage
hi_in: चरण

source: Processing files
hi_in: फ़ाइलें प्रासेस करते हुए

source: FAILED
hi_in: असफल

source: Invalid quality level. Valid values are
hi_in: अवैध गुणवत्ता स्तर. वैध वैल्यूज़ हैं

source: Utils and Config
hi_in: यूटिल्स और कॉन्फिग

source: Multimedia files
hi_in: मल्टीमीडिया फाइल्स

source: Image file manipulation
hi_in: इमिज फ़ाइल में हेरफेर

source: PDF file manipulation
hi_in: पीडीएफ फ़ाइल में हेरफेर

source: Example
hi_in: उदाहरण

source: Input folder
hi_in: इनपुट फ़ोल्डर

source: Stage 1
hi_in: चरण 1

source: Stage 2
hi_in: चरण 2

source: Output Folder
hi_in: आउटपुट फ़ोल्डर

source: Configure default options
hi_in: डिफ़ॉल्ट विकल्प कॉन्फ़िगर करें

source: Show the application help
hi_in: ऐप्लकेशन मदद दिखाएँ

source: Features
hi_in: फीचर्ज़

source: Compress image / audio / video / pdf files
hi_in: छवि/ऑडियो/वीडियो/पीडीएफ फाइल को कम्प्रेस करें

source: Convert image / audio / video / pdf files
hi_in: छवि/ऑडियो/वीडियो/पीडीएफ फाइल को कन्वर्ट करें

source: Batch file processing, for task automation using scripts
hi_in: कार्य स्वचालन के लिए बैच फाइल प्रोसेस हो रही है

source: Configure default options for conversion / compression
hi_in: कन्वर्श़न/कम्प्रेशनके लिए डिफ़ॉल्ट विकल्प कॉन्फ़िगर करें

source: Supports various input and output formats
hi_in: विभिन्न इनपुट और आउटपुट प्रारूपों का समर्थन करता है

source: For more information, visit
hi_in: अधिक जानकारी के लिए देखें

source: Enable verbose mode
hi_in: वर्बोज मोड सक्षम करें

source: Enable debug mode
hi_in: डिबग मोड सक्षम करें

source: ENABLED
hi_in: इनेबल्ड

source: Debug mode
hi_in: डिबग मोड

source: Get information about a audio/video file.
hi_in: एक ऑडियो/वीडियो फ़ाइल के बारे में जानकारी देखें।

source: Format
hi_in: फॉर्मैट

source: Duration
hi_in: डुरेशन

source: Other properties
hi_in: अन्य गुण

source: Examples
hi_in: इग्ज़ैम्पल

source: Parsing file metadata
hi_in: फ़ाइल मेटाडाटा पार्स की जा रही है

source: File Information
hi_in: फाइल जानकारी

source: Name
hi_in: नाम

source: Size
hi_in: साइज़

source: Bitrate
hi_in: बिटरेट

source: Media Streams
hi_in: मीडिया स्ट्रीम्स

source: Stream
hi_in: स्ट्रीम

source: Codec
hi_in: कोडेक

source: Resolution
hi_in: रेसोलुशन

source: Sampling rate
hi_in: सैंपलिंग रेट

source: Channels
hi_in: चैनल्स

source: Chapters
hi_in: अध्याय

source: Time
hi_in: समय

source: File Analysis
hi_in: फ़ाइल विश्लेषण

source: Convert a audio/video file to a different format.
hi_in: एक ऑडियो/वीडियो फ़ाइल को एक अलग प्रारूप में उलट दें.

source: Input file
hi_in: इनपुट फ़ाइल

source: Output file
hi_in: आउटपुट फ़ाइल

source: Video bitrate in kbps
hi_in: (केबीपीएस में) ऑडियो बिटरेट

source: Processing file
hi_in: प्रोसेसिंग फाइल

source: FFMpeg convertion
hi_in: FFMpeg में परिवर्तन

source: Creates a batch file processing pipeline (for tasks automation).
hi_in: बैच फाइल प्रोसेसिंग पाइपलाइन बनाता है (कार्य स्वचालन के लिए)

source: Placeholders available for commands
hi_in: कमांड के लिए प्लेसहोल्डर उपलब्ध

source: Replaced by the first file path found in pipeline stage.
hi_in: पाइपलाइन चरण में पाए गए पहले फाइल पथ से रिप्लेस ।

source: The name of the input file.
hi_in: इनपुट फ़ाइल का नाम.

source: The extension of the input file.
hi_in: इनपुट फ़ाइल का एक्सटेंशन

source: The directory of the input path (previous pipeline stage).
hi_in: इनपुट पथ की डायरेक्टरी (पूर्व पाइपलाइन चरण)

source: The directory of the output path (current pipeline stage).
hi_in: आउटपुट पथ की डायरेक्टरी (वर्तमान पाइपलाइन चरण)

source: Name of the processing stage (e.g., image_convert)
hi_in: प्रोसेसिंग चरण का नाम (जैसे, image_convert)

source: Type command here
hi_in: यहाँ पर कमांड टाइप करें

source: e.g.
hi_in: जैसे,

source: Need another pipeline stage
hi_in: एक और पाइपलाइन चरण की जरूरत है

source: Batch creation
hi_in: बैच क्रिएशन

source: Execute batch file processing pipeline.
hi_in: बैच फाइल प्रोसेसिंग पाइपलाइन निष्पादित (चलायें) करें।

source: Pipeline folder
hi_in: पाइपलाइन फ़ोल्डर

source: Batch execution
hi_in: बैच निष्पादन

source: Show the current configuration of the application
hi_in: एप्लीकेशन का मौजूदा कॉन्फ़िगरेशन दिखाएँ

source: Configuration
hi_in: कॉन्फ़िगरेशन

source: Configure the default options for the file converter.
hi_in: फ़ाइल परिवर्तक के लिए मूलभूत विकल्प कॉन्फ़िगर करें.

source: Configuration file
hi_in: कॉन्फ़िगरेशन फ़ाइल

source: updated
hi_in: उद्दिनांकित (अप्डैटिड)

source: Get EXIF information about a image file.
hi_in: छवि फ़ाइल के बारे में जानकारी प्राप्त करें.

source: This command retrieves metadata and other information about the image file
hi_in: यह कमांड मेटाडाटा तथा छवि फ़ाइल के बारे में अन्य जानकारी को पुनर्प्राप्त करता है

source: Convert a list of image files to one PDF file, one image per page.
hi_in: छवि फ़ाइल की सूची को एक पीडीएफ फाइल, प्रति पृष्ठ एक छवि में बदलें.

source: Figure adjusted to fit in PDF size
hi_in: पीडीएफ आकार में फिट करने के लिए समायोजित आंकड़ा

source: without any empty borders (cut figure if needed)
hi_in: बिना किसी खाली सीमा के (यदि आवश्यक हो तो आंकड़ा काटें)

source: Input files
hi_in: इनपुट फ़ाइल

source: Image quality in dots per inch (DPI). Valid values are between 40-3600.
hi_in: डॉट्स प्रति इंच में छवि की गुणवत्ता (डीपीआई) वैध मूल्य 40-3600 के बीच हैं।

source: PDF generation
hi_in: पीडीएफ उत्पादन

source: Convert a image file to a different format.
hi_in: छवि फ़ाइल को भिन्न प्रारूप में बदलें|

source: Image quality. Valid values are between 1-100.
hi_in: छवि की गुणवत्ता. वैध मान 1-100 के बीच हैं।

source: Image convertion
hi_in: छवि परिवर्तन

source: Rotate a image file (clockwise or anti-clockwise).
hi_in: छवि फ़ाइल को (क्लाक्वाइज़ या विपरीत) दिशा में घुमाएँ.

source: Image rotation
hi_in: छवि परिक्रमण

source: Mirror an image file (vertically or horizontally).
hi_in: छवि फ़ाइल को प्रतिबिंबित करें (खड़ा या क्षैतिज)।

source: Axis. Valid values are 'x' (mirror horizontally) or 'y' (flip vertically).
hi_in: अक्ष। वैध मान हैं 'x' (मिरर हॉरिज़ॉन्टली) या 'y' (फ्लिप वर्टिकली)

source: Image mirroring
hi_in: छवि मिररिंग

source: Security commands
hi_in: सुरक्षा कमांड

source: Repair (lightly) corrupted PDF files (requires QPDF external library).
hi_in: (हल्के से) खराब पीडीएफ फाइल की मरम्मत करें (qpdf एक्सटर्नल लाइब्रेरी की आवश्यकता)

source: Defaults to None
hi_in: किसी के लिए डिफ़ॉल्ट नहीं

source: use the same input file as output name
hi_in: आउटपुट नाम के रूप में समान (same) इनपुट फ़ाइल का उपयोग करें

source: with _repaired.pdf at the end
hi_in: अंतिम समय पर _repaired.pdf से

source: Password used to open protected file. Defaults to None (do not decrypt).
hi_in: संरक्षित फ़ाइल खोलने के लिए पासवर्ड. किसी के लिए डिफ़ॉल्ट नहीं (डिक्रिप्ट नहीं करें)

source: Repair PDF
hi_in: पीडीएफ ठीक करें

source: Merge (join) input PDFs into a single PDF file.
hi_in: इनपुट पीडीएफ फाइल को एक पीडीएफ फाइल में मिलाएँ.

source: Invalid filepath format
hi_in: अवैध फ़ाइलपथ प्रारूप

source: Valid format is 'filepath:password' or 'filepath'
hi_in: वैध प्रारूप है 'filepath:password' या 'filepath'

source: Split PDF pages into several 1-page PDFs.
hi_in: पेज मिलाएँ

source: Split pages of input_file.pdf into output_file_X.pdf files
hi_in: output_file_X.pdf में input_file.pdf के पृष्ठों को विभाजित करें

source: For every PDF page, generate a "input_file_X.pdf" file
hi_in: हर पीडीएफ पेज के लिए, एक उत्पन्न करें "input_file_X.pdf" फाइल

source: Output file path
hi_in: आउटपुट फ़ाइल पथ

source: Split pages
hi_in: पृष्ठ विभाजित करें

source: Extract specific pages from a PDF.
hi_in: एक पीडीएफ से विशिष्ट पृष्ठ निकालें.

source: Extract pages 1-2 and 3
hi_in: पृष्ठ 1-2 और 3 निकालें

source: List of pages to extract. Format page_num1 page_num2 ...
hi_in: निकालने के लिए पृष्ठों की सूची. प्रारूप : page_num1 page_num2 ...

source: Invalid page instruction
hi_in: अवैध पृष्ठ अनुदेश

source: Valid format is 'begin-end' or 'page_num'
hi_in: वैध प्रारूप है 'begin-end' या 'page_num'

source: Invalid begin-end page interval
hi_in: अवैध begin-end पृष्ठ अंतराल

source: End Page < Begin Page
hi_in: अंत पृष्ठ < प्रारंभ पृष्ठ

source: Extract pages
hi_in: पृष्ठ निकालें

source: Rotate PDF pages (clockwise or anti-clockwise).
hi_in: पीडीएफ पृष्ठ को घुमाएं (क्लॉकवाइज़ या एंटी-क्लॉकवाइज)

source: Rotate page 1 by 180 degress
hi_in: पृष्ठ 1 को 180 डिग्री द्वारा घुमाएँ

source: Rotate page 5-7 by 90 degress, 9 by -90 degrees, 10-15 by 180 degrees
hi_in: पृष्ठ 5-7 को 90 डिग्री से घुमाएं 9 को 90 डिग्री से 10-15 को 180 डिग्री से

source: Invalid rotation instruction
hi_in: अवैध रोटेशन अनुदेश

source: Valid format is 'begin-end:degree' or 'page:degree'
hi_in: वैध प्रारूप है : 'begin-end:degree' या 'page:degree'

source: Rotate pages
hi_in: पृष्ठ घुमाएँ

source: Protect PDF file with a password (create encrypted PDF file).
hi_in: पीडीएफ फाइल को पासवर्ड से सुरक्षित रखें (एनक्रिप्टेड पीडीएफ फाइल बनाएँ)

source: User can copy text/images. Default to False (not set).
hi_in: उपयोगकर्ता टेक्स्ट या छवियों को कॉपी कर सकते हैं। डिफ़ॉल्ट में false (सेट नहीं)

source: User can use screen readers for accessibility. Default to True (allow).
hi_in: उपयोगकर्ता स्क्रीन रीडर का उपयोग पहुंच के लिए कर सकते हैं। डिफ़ॉल्ट में true (allow)

source: User can print (low quality). Defaults to True (allow).
hi_in: उपयोगकर्ता प्रिंट (कम गुणवत्ता) कर सकते हैं। डिफ़ॉल्ट में true (allow)

source: Encryption
hi_in: एन्क्रिप्शन

source: Remove password protection from a PDF file (create decrypted PDF file).
hi_in: पीडीएफ फाइल से पासवर्ड सुरक्षा हटाएं (डीक्रिप्टेड पीडीएफ फाइल बनाएँ)

source: Password used for decryption.
hi_in: डिक्रिप्शन के लिए प्रयुक्त पासवर्ड।

source: Decryption
hi_in: डिक्रिप्शन

source: Executable
hi_in: एक्सेक्यूटेबल

source: Marking dependency
hi_in: मार्किंग डिपेंडेंसी

source: for installation
hi_in: इन्स्टलेशन के लिए

source: Package manager is not supported on
hi_in: पैकेज मैनिजर समर्थित नहीं है

source: Installing package manager
hi_in: पैकेज मैनिजर की स्थापना

source: Must be a bool or None.
hi_in: एक बूल होना चाहिए।

source: Must be a positive integer.
hi_in: एक पाज़िटिव इन्टिजर होना चाहिए।

source: Invalid type
hi_in: अवैध टाइप

source: for
hi_in: के लिये

source: Valid values are Iterable | str | None
hi_in: वैध वैल्यूज़ Iterable हैं | str | None

source: Unsupported format
hi_in: असमर्थित फ़ॉर्मेट

source: Supported formats are
hi_in: समर्थित प्रारूप हैं
